{
    "tajweed_rules_text": "Aturan Tajwid",
    "tajweed_rules_desc": "Tajwid adalah seperangkat aturan yang mengatur pelafalan dan pengucapan yang benar dari teks Al-Qur'an ketika dibaca.",
    "read_our_blog_text": "Baca blog kami",
    "madd_text": "Madd:",
    "ghunnah_text": "Ghunnah",
    "qalqala_text": "Qalqalah",
    "tafkhim_text": "Tafkhim",
    "silent_text": "Harf Diam",
    "necessary_prolongation_text": "Mad Lazim (Panjangan Wajib)",
    "obligatory_prolongation_text": "Mad Wajib (Panjangan Tertentu)",
    "permissible_prolongation_text": "Mad Jaiz (Panjangan Boleh)",
    "normal_prolongation_text": "Mad Thabi'i (Panjangan Normal)",
    "nasalization_text": "Dengung (Ghunnah)",
    "echoing_sound_text": "Bunyi Gema (Qalqalah)",
    "emphatic_text": "Pengucapan Huruf Tafkhim",
    "unannounced_pronunciation_text": "Huruf Tak Terucap",
    "necessary_prolongation_desc": "Warna merah tua menunjukkan mad lazim, yaitu panjangan wajib sebanyak 6 harakat. Ini berlaku dalam kasus seperti مد لازم (Madd Laazim). Contoh: \"الضَّالِّينَ\"",
    "obligatory_prolongation_desc": "Warna merah muda menunjukkan mad wajib yang biasanya dipanjangkan 4 atau 5 harakat, tergantung konteks. Ini termasuk مد واجب متصل (Madd Wajib Muttasil). Contoh: \"سَمَاءٍ\"",
    "permissible_prolongation_desc": "Warna oranye menunjukkan panjangan yang dapat bervariasi antara 2, 4, atau 6 harakat. Ini terjadi pada kasus seperti مد عارض للسكون (Madd 'Aarid Li-Sukoon). Contoh: akhir kata \"الْعَالَمِينَ\" ketika waqaf.",
    "normal_prolongation_desc": "Warna kuning kecokelatan menunjukkan mad thabi'i, yaitu pemanjangan normal sebanyak 2 harakat. Contoh: \"عَظِيمٌ\"",
    "nasalization_desc": "Warna hijau menunjukkan Ghunnah, yaitu dengung yang keluar dari rongga hidung selama dua harakat. Ghunnah terjadi dalam beberapa kondisi:\n\n• Ketika ن (Nun) atau م (Mim) memiliki tasydid, seperti pada إِنَّهُمْ.\n\n• Pada Noon Sakinah (نْ) atau Tanwin yang bertemu dengan huruf ب, sehingga muncul م kecil (م) dengan Ghunnah. Ini disebut Iqlab. Contoh:\nمِنْ بَعْدِ → dibaca \"Mimba'd\"\nسَمِيعٌ بَصِيرٌ → Tanwin berubah menjadi Mim dengan Ghunnah.\n\n• Pada Noon Sakinah atau Tanwin yang bertemu dengan salah satu dari 15 huruf Ikhfa' (ت، ث، ج، د، ذ، ز، س، ش، ص، ض، ط، ظ، ف، ق، ك). Suara ن disamarkan dan dibaca dengan dengung.\nContoh:\nإِنْ تَكْفُرُوا\nكَذَّبَ قَبْلُ\n\n• Pada Idghaam dengan Ghunnah, yaitu ketika huruf ي، ن، م، و mengikuti Noon Sakinah atau Tanwin sehingga hurufnya melebur dengan Ghunnah.\nContoh:\nمِنْ يَقُولُ → \"Mayyaqool\"\nرَحِيمٌ وَدُودٌ → \"Rahiimuw-waduud\"\n\n• Ketika Mim Sakinah bertemu dengan ب (Ikhfa' Syafawi). Contoh: وَاعْتَصِمُوا بِحَبْلِ",
    "echoing_sound_desc": "Warna biru muda menandai huruf Qalqalah (ق ط ب ج د) ketika bersukun. Huruf ini dibaca memantul, terutama saat berhenti atau di akhir ayat. Contoh: \"أَحَدٌ\"",
    "emphatic_desc": "Warna biru tua menunjukkan huruf-huruf tafkhim (pengucapan berat) seperti ر ketika dibaca tafkhim, serta huruf isti'laa: خ، ص، ض، غ، ط، ق، ظ. Huruf-huruf ini dibaca dengan suara penuh dan tebal. Contoh: \"الْحَرَامَ\", \"خَالِدِينَ\", \"الصَّالِحَاتِ\", \"الْمُسْتَقِيمَ\".",
    "unannounced_pronunciation_desc": "Warna abu menandai huruf yang tidak dibaca (silent letters) atau tanda yang dilebur dalam pengucapan. Contoh: ل pada \"الشَّمْسِ\" dan ن dalam \"كَانَ لَمْ\" yang dibaca seperti \"كَأْلَمْ\"."
}