{
    "tajweed_rules_text": "قواعد التجويد",
    "tajweed_rules_desc": "التجويد هو مجموعة القواعد التي تضبط النطق الصحيح لمخارج الحروف وصفاتها عند تلاوة القرآن الكريم.",
    "read_our_blog_text": "اقرأ مدونتنا",
    "madd_text": "المد:",
    "ghunnah_text": "الغُنَّة",
    "qalqala_text": "القلقلة",
    "tafkhim_text": "التفخيم",
    "silent_text": "حرف ساكن",
    "necessary_prolongation_text": "المد اللازم",
    "obligatory_prolongation_text": "المد الواجب",
    "permissible_prolongation_text": "المد الجائز",
    "normal_prolongation_text": "المد الطبيعي",
    "nasalization_text": "الغُنَّة",
    "echoing_sound_text": "الصوت الم echoي (القلقلة)",
    "emphatic_text": "النطق المفخم للحروف الثقيلة",
    "unannounced_pronunciation_text": "النطق المحذوف أو غير المعلن",
    "necessary_prolongation_desc": "يشير اللون الأحمر الداكن إلى المد اللازم، حيث تكون الإطالة ست حركات. يأتي هذا في حالات مثل المد اللازم. مثال: \"الضَّالِّينَ\".",
    "obligatory_prolongation_desc": "يشير اللون الوردي إلى المد الواجب، وغالبًا ما يكون بمقدار أربع أو خمس حركات بحسب السياق. يشمل ذلك المد الواجب المتصل. مثال: كلمات مثل \"سَمَاءٍ\".",
    "permissible_prolongation_desc": "يشير اللون البرتقالي إلى المد الجائز الذي يختلف بين حركتين أو أربع أو ست حركات. وي occurs في حالات مثل مد عارض للسكون. مثال: في نهاية كلمة \"الْعَالَمِينَ\" عند الوقف.",
    "normal_prolongation_desc": "يمثل اللون الأصفر المائل إلى البني المد الطبيعي بمقدار حركتين، وهو المد الأصلي. مثال: \"عَظِيمٌ\".",
    "nasalization_desc": "يشير اللون الأخضر إلى الغُنَّة، وهو صوت أنفي يخرج من الخيشوم ويستمر بمقدار حركتين. وتكون الغنة في عدة حالات:\n\n• إذا جاء حرف النون (ن) أو الميم (م) مشددًا، مثل: إِنَّهُمْ.\n\n• إذا جاءت نون ساكنة (نْ) أو تنوين (ـً ـٍ ـٌ) وبعده حرف الباء (ب)، تُقلب النون ميماً مخفاة مع غنة، ويسمى إقلابًا.\nأمثلة:\nمِنْ بَعْدِ → تُنطق \"مِمْبَعْدِ\".\nسَمِيعٌ بَصِيرٌ → تُنطق بتنغيم غنة.\n\n• إذا جاءت نون ساكنة أو تنوين وبعدها أحد حروف الإخفاء الخمسة عشر (ت، ث، ج، د، ذ، ز، س، ش، ص، ض، ط، ظ، ف، ق، ك)، فيُخفى صوت النون ويُستعاض عنه بالغنة.\nأمثلة:\nإِنْ تَكْفُرُوا\nكَذَّبَ قَبْلُ\n\n• إذا جاءت حروف الإدغام بغنة (ي، ن، م، و) بعد نون ساكنة أو تنوين، تُدغم مع غنة.\nأمثلة:\nمِنْ يَقُولُ → تُنطق \"مَيَّقُولُ\".\nرَحِيمٌ وَدُودٌ → تُنطق بغنة واضحة.\n\n• إذا جاءت ميم ساكنة (مْ) وبعدها باء (ب)، تُنطق الميم بغنة (إخفاء شفوي).\nمثال: وَاعْتَصِمُوا بِحَبْلِ.",
    "echoing_sound_desc": "يشير اللون الأزرق الفاتح إلى حروف القلقلة (ق، ط، ب، ج، د) عند كونها ساكنة، مثل في كلمة \"أَحَدٌ\". تُنطق هذه الحروف بصدى خفيف، خصوصًا عند الوقف أو نهاية الآية.",
    "emphatic_desc": "يشير اللون الأزرق الداكن إلى حرف الراء عند تفخيمه، وكذلك جميع حروف الاستعلاء (خ، ص، ض، غ، ط، ق، ظ). تُنطق هذه الحروف بصوت ممتلئ ومفخم. أمثلة: \"الْحَرَامَ\"، \"خَالِدِينَ\"، \"الصَّالِحَاتِ\"، \"الْمُسْتَقِيمَ\".",
    "unannounced_pronunciation_desc": "يشير اللون الرمادي إلى الحروف أو الحركات التي تكون غير منطوقة أو مدغمة ولا يُسمع لها صوت أثناء التلاوة. ومن أمثلتها: لام الشمسية في \"الشَّمْسِ\"، والنون المحذوفة في \"كَانَ لَمْ\" حيث تُنطق \"كَأْلَمْ\"."
}