{
    "tajweed_rules_text": "Tajweed Rules",
    "tajweed_rules_desc": "Tajweed is the set of rules governing the correct pronunciation and articulation of the Quranic text during recitation.",
    "read_our_blog_text": "Read our blog",
    "madd_text": "Madd:",
    "ghunnah_text": "Ghunnah",
    "qalqala_text": "Qalqala",
    "tafkhim_text": "Tafkhim",
    "silent_text": "Silent",
    "necessary_prolongation_text": "Necessary Prolongation",
    "obligatory_prolongation_text": "Obligatory Prolongation",
    "permissible_prolongation_text": "Permissible Prolongation",
    "normal_prolongation_text": "Normal Prolongation",
    "nasalization_text": "Nasalization",
    "echoing_sound_text": "Echoing Sound",
    "emphatic_text": "Emphatic Pronunciation of Heavy Letters",
    "unannounced_pronunciation_text": "Unannounced Pronunciation",
    "necessary_prolongation_desc": "The dark red color indicates necessary prolongation, where the elongation is 6 vowels. This applies in cases like مد لازم (Madd Laazim). Example: \"الضَّالِّينَ\"",
    "obligatory_prolongation_desc": "The pink color signifies obligatory prolongation, typically 4 or 5 vowels, depending on the context. This could include مد واجب متصل (Madd Wajib Muttasil). Example: Words like \"سَمَاءٍ\"",
    "permissible_prolongation_desc": "The orange color marks elongations that vary between 2, 4, or 6 vowels. This occurs in situations like مد عارض للسكون (Madd 'Aarid Li-Sukoon). Example: At the end of \"الْعَالَمِينَ\" when stopping.",
    "normal_prolongation_desc": "The yellow-brown color represents normal prolongation of 2 vowels, which is the standard for natural prolongation (مد طبيعي Madd Tabee'i) Example: \"عَظِيمٌ\"",
    "nasalization_desc": "The green color indicates Ghunnah, a nasal sound that resonates from the nose and lasts for two vowels. Ghunnah occurs in several cases:\n\n• When ن (Noon) or م (Meem) carries shaddah (emphasis), such as in إِنَّهُمْ.\n\n• When Noon Sakinah (نْ) or Tanween (ـًـٍـٌ) is followed by Baa (ب), a small Meem (م) is added and pronounced with Ghunnah. This is known as Iqlaab (inversion).\nExamples:\nمِنْ بَعْدِ\nPronounced as \"Mimba'd\", with Ghunnah on the second Meem (م).\nسَمِيعٌ بَصِيرٌ\nPronounced as \"Sami'um Basir\", where the Tanween is converted into Meem with Ghunnah.\n\n• When Noon Sakinah (نْ) or Tanween (ـًـٍـٌ) is followed by one of the fifteen letters of Ikhfaa' (ت، ث، ج، د، ذ، ز، س، ش، ص، ض، ط، ظ، ف، ق، ك). In these cases, the sound of the Noon (ن) or Tanween (ـًـٍـٌ) is hidden (the tongue does not touch the roof of the mouth) and it is pronounced instead with Ghunnah.\nExamples:\nإِنْ تَكْفُرُوا\nكَذَّبَ قَبْلُ\n\n• When the letters of Idghaam with Ghunnah (يَا يُو ي، Noon ن، Meem م، and Waw و) follow a Noon Sakinah (نْ) or Tanween (ـًـٍـٌ), they are pronounced with Ghunnah.\nExamples:\nمِنْ يَقُولُ\nPronounced as \"Mayyaqool\" (Noon merges into Yaa with Ghunnah).\nرَحِيمٌ وَدُودٌ\nPronounced as \"Rahiimuw-waduud\" (Tanween merges into Waw with Ghunnah).\n\n• When Meem Sakinah (مْ) is followed by a Baa (ب), it is pronounced with a nasalized Meem sound (م). Known as Ikhfaa' Shafawi, an example of this is: وَاعْتَصِمُوا بِحَبْلِ",
    "echoing_sound_desc": "The light blue color identifies the letters of Qalqala (ق ط ب ج د) when they have سكون (e.g., \"أَحَدٌ\"). These letters are pronounced with a slight echo or bouncing sound, especially at the end of a verse or pause.",
    "emphatic_desc": "The dark blue color highlights ر (Ra') when pronounced with tafkhim (a heavy, emphatic sound), as well as all other letters of isti'laa (elevation), which include: خ، ص، ض، غ، ط، ق، ظ. These letters are pronounced with a full, resonant sound. Examples: \"الْحَرَامَ\", \"خَالِدِينَ\", \"الصَّالِحَاتِ\",\"الْمُسْتَقِيمَ\".",
    "unannounced_pronunciation_desc": "The grey color highlights letters that are silent and diacritics that are merged/assimilated and do not contribute any sound during recitation. Examples include the ل in الشَّمْسِ and the ن in كَانَ لَمْ pronounced as كَأْلَمْ instead."
}